# A. Data Definition Language (DDL)

## A.1. Create Table

### Create table `teachers`

In [ ]:
CREATE TABLE teachers (
    id INT NOT NULL PRIMARY KEY AUTO_INCREMENT,
    first_name varchar(25),
    last_name varchar(50),
    school varchar(50),
    hire_date date,
    salary numeric
    );

## A.2. Delete Table

### Delete table `teachers` (table and its data)

In [ ]:
DROP TABLE teachers;

---
### Delete data on table `teachers` (only its data)

In [ ]:
TRUNCATE TABLE teachers;

## A.3. Modify Table (ALTER)

The `ALTER TABLE` statement is used to :
* add, delete, or modify columns in an existing table. 
* add and drop various constraints on an existing table.

### Add a new column on `teachers`

In [ ]:
ALTER TABLE teachers
ADD age INT;

---
### Delete a column on `teachers`

In [ ]:
ALTER TABLE teachers
DROP COLUMN age;

---
### Change data type of a column

In [ ]:
ALTER TABLE teachers
MODIFY COLUMN salary INT;

---
### Rename table name

In [ ]:
ALTER TABLE teachers
RENAME TO guru;

---
### Rename column name

In [ ]:
ALTER TABLE teachers
CHANGE COLUMN first_name nama_depan varchar(50);

# B. Data Manipulation Language (DML)

## B.1. Insert

With param `id`

In [ ]:
INSERT INTO teachers (id, first_name, last_name, school, hire_date, salary)
    VALUES (1,'Janet', 'Smith', 'MIT', '2011-10-30', 36200),
           (2,'Lee', 'Reynolds', 'MIT', '1993-05-22', 65000),
           (3,'Samuel', 'Cole', 'Cambridge University', '2005-08-01', 43500),
           (4,'Samantha', 'Bush', 'Cambridge University', '2011-10-30', 36200),
           (5,'Betty', 'Diaz', 'Cambridge University', '2005-08-30', 43500),
           (6,'Kathleen', 'Roush', 'MIT', '2010-10-22', 38500),
           (7,'James', 'Diaz', 'Harvard University', '2003-07-18', 61000),
           (8,'Zack', 'Smith', 'Harvard University', '2000-12-29', 55500),
           (9,'Luis', 'Gonzales', 'Standford University', '2002-12-01', 50000),
           (10,'Frank', 'Abbers', 'Standford University', '1999-01-30', 66000);

Without param `id`

In [ ]:
INSERT INTO teachers (first_name, last_name, school, hire_date, salary)
    VALUES ('Samuel', 'Abbers', 'Standford University', '2006-01-30', 32000),
           ('Jessica', 'Abbers', 'Standford University', '2005-01-30', 33000),
           ('Tom', 'Massi', 'Harvard University', '1999-09-09', 39500),
           ('Esteban', 'Brown', 'MIT', '2007-01-30', 36000),
           ('Carlos', 'Alonso', 'Standford University', '2001-01-30', 44000);

---
## B.2. Update

In [ ]:
UPDATE teachers
SET salary=56000
WHERE teachers.firstname='Samuel';

---
## B.3. Delete

In [ ]:
DELETE FROM teachers
WHERE id=6;

# C. Data Query Language (DQL)

## C.1. Select all data

Case : `Display all data!`

In [ ]:
SELECT * 
FROM teachers

---
## C.2. Select particular column

Case : `Display only id and first name !`

In [ ]:
SELECT id, first_name
FROM teachers

---
## C.3. Sort Data

Case : `Display data based on first name from Z-A`

In [ ]:
SELECT * 
FROM teachers
ORDER BY first_name DESC;

---
## C.4. Group By

Case : `How many teachers in each school ?`

In [ ]:
SELECT count(id), school
FROM teachers
GROUP BY school;

---
## C.5. IN

Case : `Display all data where first name is Samantha or Samuel`

In [ ]:
SELECT *
FROM teachers
WHERE first_name IN ('Samantha', 'Samuel')

---
## C.5. AND/OR 

Case 1 : `Who are teachers from MIT that have salary more than 40000`

In [ ]:
SELECT * 
FROM teachers
WHERE school='MIT' AND salary>40000;

Case 2 : `Display all data where last name is Cole or Abbers`

In [ ]:
SELECT * 
FROM teachers
WHERE last_name='Cole' OR last_name='Abbers';

# D. Cases

Cases : 

* Case 1 : `What is the average salary of the person with the first three letters of the first name is sam ?`

* Case 2 : `Who is the teacher with the highest salary for each university ?`


* Case 3 : `Who is the teacher with the highest salary from Standford University ?`

---
## D.1. Case 1

What is the average salary of the person with the first three letters of the first name is Sam ?

In [ ]:
SELECT AVG(salary)
FROM teachers
WHERE first_name LIKE 'Sam%';

## D.2. Case 2 

`Who is the teacher with the highest salary for each university ?`

In [ ]:
SELECT id, first_name, last_name, max(salary), school
FROM teachers
GROUP BY school;

## D.3. Case 3 (Subquery)

`Who is the teacher with the highest salary from Standford University ?`

In [ ]:
-- Display person who has max salary
SELECT *
FROM teachers
WHERE salary=
  
  -- Get max salary
  (
  SELECT MAX(salary)
  FROM teachers
  WHERE school='Standford University'
  GROUP BY school);

# E. JOIN

## E.1. Add new table

In [ ]:
CREATE TABLE courses (
    id INT NOT NULL PRIMARY KEY AUTO_INCREMENT,
    name varchar(20),
    teachers_id INT,
    total_students INT
    );

## E.2. Insert Some Data

In [ ]:
INSERT INTO courses (name, teachers_id, total_students)
    VALUES  ('Calculus', 2, 20),
            ('Physics', 2, 10),
            ('Calculus', 1, 30),
            ('Computer Science', 1, 20),
            ('Politic', 4, 15),
            ('Algebra', 2, 10),
            ('Algebra', 13, 30),
            ('Computer Science', 10, 35),
            ('Life Science', 11, 20),
            ('Chemistry', 9, 22),
            ('Chemistry', 8, 16),
            ('Calculus', 5, 19),
            ('Politic', 4, 17),
            ('Biology', 6, 22),
            ('Physics', 3, 29),
            ('Biology', 8, 28),
            ('Calculus', 12, 34),
            ('Physics', 13, 34),
            ('Biology', 14, 25),
            ('Calculus', 15, 20);

---
## E.3. INNER JOIN

Case : `Display all courses with teacher's identity`

In [ ]:
SELECT *
FROM courses
JOIN teachers ON courses.teachers_id = teachers.id;

---
## E.4 Cases

* Case 1 : `Display how many courses per universities`
* Case 2 : `Display how many total_students per teachers`
* Case 3 : `Display how many courses per teachers`

---
Case 1 : `Display how many courses per universities`

In [ ]:
SELECT teachers.school, count(courses.id)
FROM courses 
JOIN teachers on courses.teachers_id=teachers.id
GROUP BY teachers.school

---
Case 2 : `Display how many total_students per teachers`

In [ ]:
SELECT teachers.id, teachers.first_name, teachers.last_name, sum(courses.total_students)
FROM courses 
JOIN teachers on courses.teachers_id=teachers.id
GROUP BY teachers.id

---
Case 3 : `Display how many courses per teachers`

In [ ]:
SELECT teachers.id, teachers.first_name, teachers.last_name, count(courses.id)
FROM courses 
JOIN teachers on courses.teachers_id=teachers.id
GROUP BY teachers.id